blog/38.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP 5.1 Computing with Register Machines: Designing Register Machines
#+subtitle: 2024-12-24 Tue (Updated on 2025-01-09 Thu; 2025-01-30 Thu)
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.60 (<a href="https://orgmode.org">Org</a> mode 9.7.9)

- The book began talking about ``processes''. [Question as an ex
  philosophy student: can we say that processes are to procedures what
  semantic content is to linguistic expressions? If the answer is yes,
  we might want to avoid saying that procedures /describe/
  processes...]

- We have described processes in terms of procedures written in Lisp.

- The ``meaning'' of those procedures, Authors say, has been explained
  by using ``models of evaluations'':
  - the substitution model (chapter 1);
  - the environment model (chapter 3);
  - the metacircular evaluator (chapter 4).

- [Q: doesn't the metacircular evaluator implement an environment
  model of evaluation?]

- Much mystery has been cleared away, but important questions have
  been left unanswered.
  - In particular, the mechanisms of control have not been explained.
    - How are values returned by the evaluation of subexpressions to
      the expressions that use them?
    - Why some recursive procedures generate iterative process (that
      is, processes whose growth complexity in space is constant) and
      some recursive procedures generate recursive processes?

- The reason such important questions remain unanswered is that the
  metacircular evaluator is itself a Lisp program so it inherits the
  control structure of the underlying Lisp system.

- To elucidate the control structure of the Lisp evaluator we shall
  descend at a more primitive level.

- Chapter 5 describes processes in terms of the operations of a
  traditional computer, a.k.a. /register machine/.

- A register machine ``sequentially executes /instructions/ that
  manipulate the contents of a fixed set of storage elements called
  /registers/'' (491).

- ``[W]e will examine some procedures and design a register machine
  for each of them. Thus, we will approach our task from the
  perspective of a hardware architect rather than that of a
  machine-language computer programmer'' (492).

- To design a register machine, me must design
  - its /data paths/;
  - its /controller/.

- Only one register can be assigned a new value at each step.

- Authors present a way to represents data paths and controllers with
  diagrams.

- As an example, they draw the data paths and controller of a ~GCD~
  machine.

- Authors present a way to describe machines in a textual form and
  presents a specification of the GCD machine.

- Authors introduce the notion of /subroutine/. [What's the def? It
  wasn't that clear.]

- Authors show that we can use a register to hold a label.

- Authors show how to use a stack to implement recursion.
  - Example: ~factorial~;
  - Example: ~fib~ (double recursion). Here is the controller for the
    ~fib~ machine with some comments:
    #+begin_src scheme
      (controller
       ;; We are going to to compute `(fib n)`.
       ;;
       ;; When we are done computing it, we have finished.
       ;;
       ;; The `continue` register stores the address of the instruction we
       ;; have to execute when we are done doing something.
       ;;
       ;; When we are done with computing `(fib n)`, we have nothing left to
       ;; do. So we set `continue` to `fib-done`.

       (assign continue (label 'fib-done))
       ;; Then we initiate the computation of `(fib n)`. We will come back
       ;; to this piece of code when, if ever, `n` will have lower values
       ;; than the initial one; so we use a label.

       fib-loop
       ;; We test whether `(< n 2)`.
       (test (op <) (reg n) (const 2))
       (branch (label immediate-answer))
       ;; Either we have the answer for `(fib n)` or we don't. If we do,
       ;; then we jump to the `immediate-answer` label with the instruction
       ;; above. If don't, then we need to recur. When we recur, we first
       ;; compute `(fib (- n 1))`, and then we compute `(fib (- n 2))`, and
       ;; finally we add the two results.
       ;;
       ;; Since we have to postpone the computation of `(fib n)`, let's save
       ;; the current values of `n` and `continue` onto the stack, so we can
       ;; come back to them when we need to do so. Once those values are
       ;; saved in the stack, we can update `n` and `continue`. We are going
       ;; to compute `(fib (- n 1))` so we set `n` to `n-1`. Once we are
       ;; done with that, we will be done computing the `(fib (- n 1))` so
       ;; we set the the value of the `continue` register to the
       ;; `after-fib-n-1` label.
       (save continue)
       (assign continue (label after-fib-n-1))
       (assign n (op -) (reg n) (const 1))
       (save n)
       ;; Now we can start the computation of `(fib (- n 1))` so we loop
       ;; back to the portion of code which starts the compuation of a fib.
       (goto (label fib-loop))

       after-fib-n-1
       ;; If we are here, then it means we have just put the value of a
       ;; `(fib (- n 1))` in the `val` register.
       ;;
       ;; Given the so, we still have to compute the value of the relevant
       ;; `(fib (- n 2))`, before we can compute the value of the relevant
       ;; (fib n) --- which, as we have already said, is the sum of `(fib (-
       ;; n 1))` and `(fib (- n 2))`.
       (restore n)
       (restore continue)

       (save continue)
       (assign continue (label after-fib-n-2))

       ;; We want to save the result of `(fib (- n 1))`, which we have
       ;; stored in val, since val will be used to store the result of `(fib
       ;; (- n 2))`
       (save val)
       (goto (label fib-loop))

       after-fib-n-2
       ;; If we are here, then it means we have just put the value of a
       ;; `(fib (- n 2))` in the `val` register.
       ;;
       ;; Remember, moreover, that the value of `(fib (- n 1))` is stored at
       ;; the top of the stack. We want to restore the value of `(fib (- n
       ;; 1))`, but we don't want to overwrite and lose the value currently
       ;; stored in the `val` register, so we move the value stored in the
       ;; the `val` register into the `n` register.
       (assign n (reg val))
       (restore val)
       ;; we restore `continue` so we know what to do once we have computed
       ;; `(fib n)`.
       (restore continue)
       ;; the value of `(fib (- n 1))` is in the `val` register and the
       ;; value of `(fib (- n 1))` is in the `n` register. We can now add
       ;; them up to get the value of `(fib n)`
       (assign val (op +) (reg val) (reg n))
       (goto (reg continue))

       immediate-answer
       ;; If we are here, then it means that we are computing `(fib n)`
       ;; where `(< n 2). The result of that is `n`. We put the result into
       ;; the `val` register.
       (assign val (reg n))
       ;; now that the result is in the `val` register, we need to know what
       ;; to do. In order to know what to do, we need to know what result is
       ;; have computed. There are three possibilities: 1) we are done; 2)
       ;; we have computed the value of a `(fib (- n 1))` recursion; 3) we
       ;; have computed the value of a `(fib (- n 2))` recursion. The
       ;; `continue` register is expected to hold the relevant label to let
       ;; us know what value we have just finished computing.
       (goto (reg continue))

       fib-done) ;; we are done
    #+end_src

