blog/38.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-11 Sat 18:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 5.1 Computing with Register Machines: Designing Register Machines</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 5.1 Computing with Register Machines: Designing Register Machines
<br />
<span class="subtitle">2024-12-24 Tue (Updated on 2025-01-09 Thu)</span>
</h1>
<ul class="org-ul">
<li>The book began talking about ``processes''. [Question as an ex
philosophy student: can we say that processes are to procedures what
semantic content is to linguistic expressions? If the answer is yes,
we might want to avoid saying that procedures <i>describe</i>
processes&#x2026;]</li>

<li>We have described processes in terms of procedures written in Lisp.</li>

<li>The ``meaning'' of those procedures, Authors say, has been explained
by using ``models of evaluations'':
<ul class="org-ul">
<li>the substitution model (chapter 1);</li>
<li>the environment model (chapter 3);</li>
<li>the metacircular evaluator (chapter 4).</li>
</ul></li>

<li>[Q: doesn't the metacircular evaluator implement an environment
model of evaluation?]</li>

<li>Much mystery has been cleared away, but important questions have
been left unanswered.
<ul class="org-ul">
<li>The mechanisms of control have not been explained.
<ul class="org-ul">
<li>How are values returned by the evaluation of subexpressions to
the expressions that use them?</li>
<li>Why some recursive procedures generate iterative process (that
is, processes whose growth complexity in space is constant) and
some recursive procedures generate recursive processes?</li>
</ul></li>
</ul></li>

<li>The reason such important questions remain unanswered is that the
metacircular evaluator is itself a Lisp program so it inherits the
control structure of the underlying Lisp system.</li>

<li>To elucidate the control structure of the Lisp evaluator we shall
descend at a more primitive level.</li>

<li>Chapter 5 describes processes in terms of the operations of a
traditional computer, a.k.a. <i>register machine</i>.</li>

<li>A register machine ``sequentially executes <i>instructions</i> that
manipulate the contents of a fixed set of storage elements called
<i>registers</i>'' (491).</li>

<li>``[W]e will examine some procedures and design a register machine
for each of them. Thus, we will approach our task from the
perspective of a hardware architect rather than that of a
machine-language computer programmer'' (492).</li>

<li>To design a register machine, me must design
<ul class="org-ul">
<li>its <i>datapaths</i>;</li>
<li>its <i>controller</i>.</li>
</ul></li>

<li>Only one register can be assigned a new value at each step.</li>

<li>Authors present a way to represents datapaths and controllers with
diagrams.</li>

<li>As an example, they draw the datapaths and controller of a <code>GCD</code>
machine.</li>

<li>Authors present a way to describe machines in a textual form and
presents a specification of the of the GCD machine.</li>

<li>Authors introduce the notion of <i>subroutine</i>. [What's the def? It
wasn't that clear.]</li>

<li>Authors show that we can use a register to hold a label.</li>

<li>Authors show how to use a stack to implement recursion
<ul class="org-ul">
<li>Example: <code>factorial</code></li>
<li>Example: <code>fib</code> (double recursion)</li>
</ul></li>
</ul>
