blog/38.org
*** Exercise 5.1
*Exercise*:

#+begin_quote
Design a register machine to compute factorials using the iterative
algorithm specified by the following procedure.  Draw data-path and
controller diagrams for this machine.

#+begin_src scheme
  (define (factorial n)
    (define (iter product counter)
      (if (> counter n)
          product
          (iter (* counter product)
                (+ counter 1))))
    (iter 1 1))
#+end_src
#+end_quote

*Answer*:

#+begin_src
                  Data paths                                                                Controller

       /\--------------------------------+
      /  \                               |                                                    start
 +---/ 1  \                             (x) 1->n                                                |
 |  /      \                   -----     |                                                      |
 | ----------       --------->(  >  )    |                                                      V
 |       \         /           -----     |                                                 +-----------+
 |  1->c (x)      /              ^       |                                                 |  1->c     |
 |         \     /               |       |                                                 |           |
 |          V   /                |       V                                                 +-----------+
 |     +----------+            +-+---------+            +------------+                          |
 |     | counter  |            |     n     |            | product    |                          |
 |     |          |            |           |            |            |                          V
 |     +----------+            +-----------+            +------------+                     +-----------+
 |      |   \    ^                                       /      ^                          |  1->n     |
 |      |    \   +------------------------+             /       |                          |           |
 |      |     \                           |            /        |                          +-----------+
 |      |      \                          |           /         |                               |
 |      |       \               +---------+-----------          |                               |
 |      |        \              |         |                     |                               V
 |      |         V             V         |                     |                               /\
 |      |      \-------------------/      |                     |                              /  \
 |      |       \                 /       |                    (x) *->p                       /    \     yes
 |      |        \       *       /        |                     |                     +----> /  >   \----------> done
 |      |         \             /         |                     |                     |      \      /
 |      |          \           /          |                     |                     |       \    /
 |      |           -----+-----           |                     |                     |        \  /
 |      |                |                |                     |                     |         \/
 |      +------------+   |                |                     |                     |         |
 |                   |   -----------------+---------------------+                     |         |
 +---------------+   |                    |                                           |         |no
                 |   |                    |                                           |         |
                 V   V                    |                                           |         |
               \-------------------/      |                                           |         V
                \                 /       |                                           |    +-----------+
                 \       +       /        |                                           |    |  *->p     |
                  \             /        (x) +->c                                     |    |           |
                   \           /          |                                           |    +-----------+
                    -----+-----           |                                           |         |
                         |                |                                           |         |
                         |                |                                           |         V
                         +----------------+                                           |    +-----------+
                                                                                      |    |  +->c     |
                                                                                      |    |           |
                                                                                      |    +----+------+
                                                                                      |         |
                                                                                      |         |
                                                                                      +---------+
       The result is stored in the product register.
#+end_src

*** Exercise 5.2
*Exercise*:

#+begin_quote
Use the register-machine language to describe the iterative factorial
machine of Exercise 5.1
#+end_quote

*Answer*:

#+begin_src scheme
  (controller
   (assign counter (const 1))
   (assign n (const 1))
  test-counter-n
   (test (op >) (reg counter) (reg n))
   (branch (label factorial-done))
   (assign product (op *) (reg counter) (reg product))
   (assign counter (op +) (reg counter) (const 1))
   (goto (label test-counter-n))
  factorial-done)
#+end_src

