blog/38.html
<div id="outline-container-org8d64eb3" class="outline-2">
<h2 id="org8d64eb3">Exercise 5.1</h2>
<div class="outline-text-2" id="text-org8d64eb3">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Design a register machine to compute factorials using the iterative
algorithm specified by the following procedure.  Draw data-path and
controller diagrams for this machine.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">factorial</span> n)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">iter</span> product counter)
    (<span style="color: #531ab6;">if</span> (&gt; counter n)
        product
        (iter (* counter product)
              (+ counter 1))))
  (iter 1 1))
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-nil">                 Data paths                                                                Controller

      /\--------------------------------+
     /  \                               |                                                    start
+---/ 1  \                             (x) 1-&gt;n                                                |
|  /      \                   -----     |                                                      |
| ----------       ---------&gt;(  &gt;  )    |                                                      V
|       \         /           -----     |                                                 +-----------+
|  1-&gt;c (x)      /              ^       |                                                 |  1-&gt;c     |
|         \     /               |       |                                                 |           |
|          V   /                |       V                                                 +-----------+
|     +----------+            +-+---------+            +------------+                          |
|     | counter  |            |     n     |            | product    |                          |
|     |          |            |           |            |            |                          V
|     +----------+            +-----------+            +------------+                     +-----------+
|      |   \    ^                                       /      ^                          |  1-&gt;n     |
|      |    \   +------------------------+             /       |                          |           |
|      |     \                           |            /        |                          +-----------+
|      |      \                          |           /         |                               |
|      |       \               +---------+-----------          |                               |
|      |        \              |         |                     |                               V
|      |         V             V         |                     |                               /\
|      |      \-------------------/      |                     |                              /  \
|      |       \                 /       |                    (x) *-&gt;p                       /    \     yes
|      |        \       *       /        |                     |                     +----&gt; /  &gt;   \----------&gt; done
|      |         \             /         |                     |                     |      \      /
|      |          \           /          |                     |                     |       \    /
|      |           -----+-----           |                     |                     |        \  /
|      |                |                |                     |                     |         \/
|      +------------+   |                |                     |                     |         |
|                   |   -----------------+---------------------+                     |         |
+---------------+   |                    |                                           |         |no
                |   |                    |                                           |         |
                V   V                    |                                           |         |
              \-------------------/      |                                           |         V
               \                 /       |                                           |    +-----------+
                \       +       /        |                                           |    |  *-&gt;p     |
                 \             /        (x) +-&gt;c                                     |    |           |
                  \           /          |                                           |    +-----------+
                   -----+-----           |                                           |         |
                        |                |                                           |         |
                        |                |                                           |         V
                        +----------------+                                           |    +-----------+
                                                                                     |    |  +-&gt;c     |
                                                                                     |    |           |
                                                                                     |    +----+------+
                                                                                     |         |
                                                                                     |         |
                                                                                     +---------+
      The result is stored in the product register.
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd6a302a" class="outline-2">
<h2 id="orgd6a302a">Exercise 5.2</h2>
<div class="outline-text-2" id="text-orgd6a302a">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Use the register-machine language to describe the iterative factorial
machine of Exercise 5.1
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(controller
 (assign counter (const 1))
 (assign n (const 1))
test-counter-n
 (test (op &gt;) (reg counter) (reg n))
 (branch (label factorial-done))
 (assign product (op *) (reg counter) (reg product))
 (assign counter (op +) (reg counter) (const 1))
 (goto (label test-counter-n))
factorial-done)
</pre>
</div>
</div>
</div>
