blog/38.html
<div id="outline-container-org276c195" class="outline-2">
<h2 id="org276c195">Exercise 5.3</h2>
<div class="outline-text-2" id="text-org276c195">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Design a machine to compute square roots using Newton's method, as
described in section 1.1.7.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">sqrt</span> x)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">good-enough?</span> guess)
    (&lt; (abs (- (square guess) x)) 0.001))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">improve</span> guess)
    (average guess (/ x guess)))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">sqrt-iter</span> guess)
    (<span style="color: #531ab6;">if</span> (good-enough? guess)
        guess
        (sqrt-iter (improve guess))))
  (sqrt-iter 1.0))
</pre>
</div>

<p>
Begin by assuming that <code>good-enough?</code> and <code>improve</code> operations are
available as primitives.  Then show how to expand these in terms of
arithmetic operations.  Describe each version of the <code>sqrt</code> machine
design by drawing a data-path diagram and writing a controller
definition in the register-machine language.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
First version of <code>sqrt</code> machine:
</p>

<p>
Data paths:
</p>
<div class="org-src-container">
<pre class="src src-nil">      /\
     /  \                                -----------------------
    /    \                               \                     /
   /      \                               \      read         /
  /   1.0  \                               \                 /
 /          \                               \               /
/            \                               ----+---------/
------+-------                                   |
      |    g&lt;-1                                  |
      +----(x)-----+                   +----------
                   |                   |
                   V                   v
          +--------------+       +------+-----+
          |              |       |            |
          |    guess     |       |      x     |
          |              |       |            |
          +----------+---+       +------------+
             |       | ^
             |       | |          g&lt;-i
             |       | +-----------(x)--------+
             V       |                        |
          -------    +--------------+         |
        -/       \-                 V         |
       /           \            --------------+---------
       |good-enough|             \                    /
       \           /              \    improve       /
        -\       /-                \                /
          -------                   \--------------/
</pre>
</div>

<p>
Controller:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(controller
 (assign guess (const 1.0))
 (assign x (op read))
test-ge
 (test (op good-enough) (reg guess))
 (branch (label sqr-done))
 (assign guess (op improve) (reg guess))
 (goto (label test-ge))
sqr-done)
</pre>
</div>

<p>
Second version of the <code>sqrt</code> machine (without the <code>good-enough</code> and
the <code>improve</code> abstractions):
</p>

<p>
Data paths:
</p>
<div class="org-src-container">
<pre class="src src-nil">            /\
           /  \
          /    \
         /      \
        /  1.0   \
       /          \
       -----+------
            |
            |
            |
            +-----------------------------+
                                          |
                                          |
                                          |
                                          V
                              ----------------------------                                                          |---------------------------|
                              |                          |                                                          |                           |
                              |                          |                                                          |                           |
                              |         guess            |                                                          |             x             |
                              |                          |                                                          |                           |
                              |                          |                                                          |                           |
                              ----------------------------                                                          |                           |
                                 |                 ^  |                                                             -----------------------------
                                 |                 |  |                                                                          |             |
                                 |                 |  +------------------------------------+                                     |             |
                                 |                 |                                       |                                     |             |
                                 |                 |                                       |          +--------------------------+             |
                                 |                 |                                       |          |                                        |
                                 |                 |                                       |          |                                        |
                                 |                 |                                       V          V                                        |
                                 |                 |                               ------------------------                                    |
                                 V                 |                                \                    /                                     |
                   |-----------------------------  |                                 \        /         /                                      |
                   |                            |  |                                  \                /                                       |
                   |                            |&lt;-+-----------------------------+     \              /     +-----------+                      |
-------------------|          tmp               |  |                             |      --------------      |           |                      |
|                  |                            |--+---------------------+       |            |    |        |           V                      |
|                  |                            |  |                     |       +------------+    +--------+     ------------------------     |
|                  |-----------------------------  |                     |                                         \                    /      |
|                    ^   |   ^  ^  |   |           |                     |                                          \     average      /       |
|          +---------+   |   |  |  |   |           |                     +-----------------------------------------&gt; \                /        |
|          |    +--------+   |  |  |   |           |                                                                  ----------------         |
|          |    |  +---------+  |  |   |           |                                                                         |                 |
|          |    |  |            |  |   |           +-------------------------------------------------------------------------+                 |
|          |    |  |  +---------+  |   +----------------------------------------+                                                              |
|          |    |  |  |            V                                            |                  +-------------------------------------------+
|          |    |  |  | -------------------------------                         V                  V
|          |    |  |  | \                            /                 -------------------------------
|          |    |  |  |  \                          /                  \                             /
|          |    |  |  |   \       square           /                    \                           /
|          |    |  |  |    \                      /                      \           -             /
|          |    |  |  |     \                    /                        \                       /
|          |    |  |  |      --------------------                          \                     /
|          |    |  |  |            |                                         -------------------
|          |    |  |  |            |                                                  |
|          |    |  |  |            |                                                  |
|          |    |  |  +------------+                                                  |
|          |    |  |                                                                  |
|          |    |  |                                                                  |
|          |    |  +------------------------------------------------------------------+
|          |    |
|          |    |
|          |    +---------------------------------+
|          |                                      |
|          |                                      |
|          |                                      V
|          |                           --------------------------
|          |                           |                        |
|          |                           |                        |
|          |                           |        abs             |
|          |                           |                        |
|          |                           |                        |
|          |                           --------------------------
|          |                                       |
|          |                                       |
|          +---------------------------------------+
|
|
|                                                               /\
|                              -------                         /  \
|                            -/       \-                      /    \
|                           /           \                    /      \
|-------------------------&gt; |     &lt;     | &lt;-----------------/        \
                            \           /                  /  0.001   \
                             -\       /-                  /            \
                               -------                    --------------
</pre>
</div>

<p>
Controller:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(controller
  (assign guess (const 1.0))
test-ge
  (assign tmp (reg guess))
  (assign tmp (op square) (reg tmp))
  (assign tmp (op -) (reg tmp) (reg x))
  (assing tmp (op abs) (reg tmp))
  (test (op &lt;) (reg tmp) (const 0.001))
  (branch (label sqrt-done))
  (assign tmp (op /) (reg x) (reg guess))
  (assign guess (op average) (reg guess) (reg tmp))
sqrt-done)
</pre>
</div>
</div>
</div>
