blog/38.org
*** Exercise 5.4
*Exercise*:

#+begin_quote
Specify register machines that implement each of the following
procedures.  For each machine, write a controller instruction sequence
and draw a diagram showing the data paths.

a. Recursive exponentiation:

#+begin_src scheme
  (define (expt b n)
    (if (= n 0)
        1
        (* b (expt b (- n 1)))))
#+end_src

b. Iterative exponentiation:

#+begin_src scheme
  (define (expt b n)
    (define (expt-iter counter product)
      (if (= counter 0)
          product
          (expt-iter (- counter 1) (* b product))))
    (expt-iter n 1))
#+end_src
#+end_quote

*Answer*:

Recursive exponentiation:
#+begin_src scheme
  ;; - example: (expt 2 3); initial values:
  ;;   - register b is set to 2
  ;;   - register n is set to 3

  (controller
     (assign continue (label fact-done))
   expt-loop
     (test (op =) (reg n) (const 0))
     (branch (label base-case))
     (save continue)
     (save n)
     ;; no need to save b since it always holds the same val
     (assign n (op -) (reg n) (const 1))
     (assign continue (label after-expt))
     (goto (label expt-loop))
   after-expt
     (restore n)
     (restore continue)
     (assign val (op *) (reg b) (reg val))
     (goto continue)
   base-case
     (assign val (const 1))
     (goto (reg continue))
   expt-done)
#+end_src

Iterative exponentiation:
#+begin_src scheme
  ;; - example: (expt 2 3); initial values:
  ;;   - register b is set to 2
  ;;   - register counter is set to 3
  ;;   - register product is set to 1

  (controller
   expt-loop
     (test (op =) (reg counter) (const 0))
     (branch expt-done)
     (assign counter (op -) (reg counter) (const 1))
     (assign product (op *) (reg b) (reg product))
     (goto expt-loop)
     expt-done)
#+end_src

*** Exercise 5.5
*Exercise*:

#+begin_quote
Hand-simulate the factorial and Fibonacci machines, using some
nontrivial input (requiring execution of at least one recursive call).
Show the contents of the stack at each significant point in the
execution.
#+end_quote

*Answer*:

- Relevant contents of the stack when computing the ~factorial~ of ~5~
  (the stack grows backwards):
  #+begin_src 
                                                      []
                                           [5|fact-done]
                              [4|after-fact|5|fact-done]
                 [3|after-fact|4|after-fact|5|fact-done]
    [2|after-fact|3|after-fact|4|after-fact|5|fact-done]
                 [3|after-fact|4|after-fact|5|fact-done]
                              [4|after-fact|5|fact-done]
                                           [5|fact-done]
                                                      []
  #+end_src

- Relevant contents of the stack when computing the ~fib~ of ~2~:
  #+begin_src 
              []  (starting point)
    [2|fib-done]  (when setting up the computation of fib(n-1))
              []  (before setting up the computation of fib(n-2))
    [1|fib-done]  (setting up the computation of fib(n-2))
              []  (before computing fib(n-1) + fib(n-2))
  #+end_src
*** Exercise 5.6
*Exercise*:

#+begin_quote
Ben Bitdiddle observes that the Fibonacci machine's controller
sequence has an extra `save' and an extra `restore', which can be
removed to make a faster machine.  Where are these instructions?
#+end_quote

*Answer*:

Those two instructions are the ~(restore continue)~ and ~(save
continue)~ in ~after-fib-n-2~. Here I create a fib-machine without
those two instructions and show that it works nonetheless:

#+begin_src
  ;; racket repl in emacs provided by racket-mode.el

  repl.rkt> (define fib-machine
              (make-machine
               '(continue n val)
               (list (list '+ +) (list '< <) (list '- -))
               '(
                 (assign continue (label fib-done))
                 fib-loop
                 (test (op <) (reg n) (const 2))
                 (branch (label immediate-answer))
                 (save continue)
                 (assign continue (label afterfib-n-1))
                 (save n)
                 (assign n (op -) (reg n) (const 1))
                 (goto (label fib-loop))
                 afterfib-n-1
                 (restore n)
                 ;; (restore continue) <----------------------------------
                 (assign n (op -) (reg n) (const 2))
                 ;; (save continue)    <----------------------------------
                 (assign continue (label afterfib-n-2))
                 (save val)
                 (goto (label fib-loop))
                 afterfib-n-2
                 (assign n (reg val))
                 (restore val)
                 (restore continue)
                 (assign val
                         (op +) (reg val) (reg n))
                 (goto (reg continue))
                 immediate-answer
                 (assign val (reg n))
                 (goto (reg continue))
                 fib-done)))
  repl.rkt> (set-register-contents! fib-machine 'n 4)
  'done
  repl.rkt> (start fib-machine)
  'done
  repl.rkt> (get-register-contents fib-machine 'val)
  3
  repl.rkt> (set-register-contents! fib-machine 'n 5)
  'done
  repl.rkt> (start fib-machine)
  'done
  repl.rkt> (get-register-contents fib-machine 'val)
  5
  repl.rkt> (set-register-contents! fib-machine 'n 6)
  'done
  repl.rkt> (start fib-machine)
  'done
  repl.rkt> (get-register-contents fib-machine 'val)
  8
  repl.rkt>
#+end_src
