blog/38.html
<div id="outline-container-orge0c069c" class="outline-2">
<h2 id="orge0c069c">Exercise 5.4</h2>
<div class="outline-text-2" id="text-orge0c069c">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Specify register machines that implement each of the following
procedures.  For each machine, write a controller instruction sequence
and draw a diagram showing the data paths.
</p>

<p>
a. Recursive exponentiation:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">expt</span> b n)
  (<span style="color: #531ab6;">if</span> (= n 0)
      1
      (* b (expt b (- n 1)))))
</pre>
</div>

<p>
b. Iterative exponentiation:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">expt</span> b n)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">expt-iter</span> counter product)
    (<span style="color: #531ab6;">if</span> (= counter 0)
        product
        (expt-iter (- counter 1) (* b product))))
  (expt-iter n 1))
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
Recursive exponentiation:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">- example: (expt 2 3); initial values:</span>
<span style="color: #595959;">;;   </span><span style="color: #595959;">- register b is set to 2</span>
<span style="color: #595959;">;;   </span><span style="color: #595959;">- register n is set to 3</span>

(controller
   (assign continue (label fact-done))
 expt-loop
   (test (op =) (reg n) (const 0))
   (branch (label base-case))
   (save continue)
   (save n)
   <span style="color: #595959;">;; </span><span style="color: #595959;">no need to save b since it always holds the same val</span>
   (assign n (op -) (reg n) (const 1))
   (assign continue (label after-expt))
   (goto (label expt-loop))
 after-expt
   (restore n)
   (restore continue)
   (assign val (op *) (reg b) (reg val))
   (goto continue)
 base-case
   (assign val (const 1))
   (goto (reg continue))
 expt-done)
</pre>
</div>

<p>
Iterative exponentiation:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">- example: (expt 2 3); initial values:</span>
<span style="color: #595959;">;;   </span><span style="color: #595959;">- register b is set to 2</span>
<span style="color: #595959;">;;   </span><span style="color: #595959;">- register counter is set to 3</span>
<span style="color: #595959;">;;   </span><span style="color: #595959;">- register product is set to 1</span>

(controller
 expt-loop
   (test (op =) (reg counter) (const 0))
   (branch expt-done)
   (assign counter (op -) (reg counter) (const 1))
   (assign product (op *) (reg b) (reg product))
   (goto expt-loop)
   expt-done)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd80cc1f" class="outline-2">
<h2 id="orgd80cc1f">Exercise 5.5</h2>
<div class="outline-text-2" id="text-orgd80cc1f">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Hand-simulate the factorial and Fibonacci machines, using some
nontrivial input (requiring execution of at least one recursive call).
Show the contents of the stack at each significant point in the
execution.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<ul class="org-ul">
<li><p>
Relevant contents of the stack when computing the <code>factorial</code> of <code>5</code>
(the stack grows backwards):
</p>
<div class="org-src-container">
<pre class="src src-nil">                                                  []
                                       [5|fact-done]
                          [4|after-fact|5|fact-done]
             [3|after-fact|4|after-fact|5|fact-done]
[2|after-fact|3|after-fact|4|after-fact|5|fact-done]
             [3|after-fact|4|after-fact|5|fact-done]
                          [4|after-fact|5|fact-done]
                                       [5|fact-done]
                                                  []
</pre>
</div></li>

<li><p>
Relevant contents of the stack when computing the <code>fib</code> of <code>2</code>:
</p>
<div class="org-src-container">
<pre class="src src-nil">          []  (starting point)
[2|fib-done]  (when setting up the computation of fib(n-1))
          []  (before setting up the computation of fib(n-2))
[1|fib-done]  (setting up the computation of fib(n-2))
          []  (before computing fib(n-1) + fib(n-2))
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org84b1e53" class="outline-2">
<h2 id="org84b1e53">Exercise 5.6</h2>
<div class="outline-text-2" id="text-org84b1e53">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Ben Bitdiddle observes that the Fibonacci machine's controller
sequence has an extra `save' and an extra `restore', which can be
removed to make a faster machine.  Where are these instructions?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
Those two instructions are the <code>(restore continue)</code> and <code>(save
continue)</code> in <code>after-fib-n-2</code>. Here I create a fib-machine without
those two instructions and show that it works nonetheless:
</p>

<div class="org-src-container">
<pre class="src src-nil">;; racket repl in emacs provided by racket-mode.el

repl.rkt&gt; (define fib-machine
            (make-machine
             '(continue n val)
             (list (list '+ +) (list '&lt; &lt;) (list '- -))
             '(
               (assign continue (label fib-done))
               fib-loop
               (test (op &lt;) (reg n) (const 2))
               (branch (label immediate-answer))
               (save continue)
               (assign continue (label afterfib-n-1))
               (save n)
               (assign n (op -) (reg n) (const 1))
               (goto (label fib-loop))
               afterfib-n-1
               (restore n)
               ;; (restore continue) &lt;----------------------------------
               (assign n (op -) (reg n) (const 2))
               ;; (save continue)    &lt;----------------------------------
               (assign continue (label afterfib-n-2))
               (save val)
               (goto (label fib-loop))
               afterfib-n-2
               (assign n (reg val))
               (restore val)
               (restore continue)
               (assign val
                       (op +) (reg val) (reg n))
               (goto (reg continue))
               immediate-answer
               (assign val (reg n))
               (goto (reg continue))
               fib-done)))
repl.rkt&gt; (set-register-contents! fib-machine 'n 4)
'done
repl.rkt&gt; (start fib-machine)
'done
repl.rkt&gt; (get-register-contents fib-machine 'val)
3
repl.rkt&gt; (set-register-contents! fib-machine 'n 5)
'done
repl.rkt&gt; (start fib-machine)
'done
repl.rkt&gt; (get-register-contents fib-machine 'val)
5
repl.rkt&gt; (set-register-contents! fib-machine 'n 6)
'done
repl.rkt&gt; (start fib-machine)
'done
repl.rkt&gt; (get-register-contents fib-machine 'val)
8
repl.rkt&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div style="text-align: center;"><a href="./posts.html">←</a></div><p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.60 (<a href="https://orgmode.org">Org</a> mode 9.7.9)</span></p>
</div>
</body>
</html>
